In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name":["Rajeev", "Anand", "Arundhati", "Rai"],
    "marks":[87, 78, 90, 32],
    "city":["Rampur", "Delhi", "Kolkata","bariley"]
    
}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

        name  marks     city
0     Rajeev     87   Rampur
1      Anand     78    Delhi
2  Arundhati     90  Kolkata
3        Rai     32  bariley

In [7]:
df.to_csv("friends.csv")